Samsung/TizenRT/os/arch/xtensa/src/esp32/chip/esp32_sens_reg.h
#define SENS_ULP_CP_SLEEP_CYC1_REG          (DR_REG_SENS_BASE + 0x001c)
/* SENS_SLEEP_CYCLES_S1 : R/W ;bitpos:[31:0] ;default: 32'd100 ; */
/*description: */
#define SENS_SLEEP_CYCLES_S1  0xFFFFFFFF
#define SENS_SLEEP_CYCLES_S1_M  ((SENS_SLEEP_CYCLES_S1_V) << (SENS_SLEEP_CYCLES_S1_S))
#define SENS_SLEEP_CYCLES_S1_V  0xFFFFFFFF
#define SENS_SLEEP_CYCLES_S1_S  0

#define SENS_ULP_CP_SLEEP_CYC2_REG          (DR_REG_SENS_BASE + 0x0020)
/* SENS_SLEEP_CYCLES_S2 : R/W ;bitpos:[31:0] ;default: 32'd50 ; */
/*description: */
#define SENS_SLEEP_CYCLES_S2  0xFFFFFFFF
#define SENS_SLEEP_CYCLES_S2_M  ((SENS_SLEEP_CYCLES_S2_V) << (SENS_SLEEP_CYCLES_S2_S))
#define SENS_SLEEP_CYCLES_S2_V  0xFFFFFFFF
#define SENS_SLEEP_CYCLES_S2_S  0

#define SENS_ULP_CP_SLEEP_CYC3_REG          (DR_REG_SENS_BASE + 0x0024)
/* SENS_SLEEP_CYCLES_S3 : R/W ;bitpos:[31:0] ;default: 32'd40 ; */
/*description: */
#define SENS_SLEEP_CYCLES_S3  0xFFFFFFFF
#define SENS_SLEEP_CYCLES_S3_M  ((SENS_SLEEP_CYCLES_S3_V) << (SENS_SLEEP_CYCLES_S3_S))
#define SENS_SLEEP_CYCLES_S3_V  0xFFFFFFFF
#define SENS_SLEEP_CYCLES_S3_S  0

#define SENS_ULP_CP_SLEEP_CYC4_REG          (DR_REG_SENS_BASE + 0x0028)
/* SENS_SLEEP_CYCLES_S4 : R/W ;bitpos:[31:0] ;default: 32'd20 ; */
/*description: */
#define SENS_SLEEP_CYCLES_S4  0xFFFFFFFF
#define SENS_SLEEP_CYCLES_S4_M  ((SENS_SLEEP_CYCLES_S4_V) << (SENS_SLEEP_CYCLES_S4_S))
#define SENS_SLEEP_CYCLES_S4_V  0xFFFFFFFF
#define SENS_SLEEP_CYCLES_S4_S  0

#define SENS_SAR_START_FORCE_REG          (DR_REG_SENS_BASE + 0x002c)
/* SENS_SAR2_PWDET_EN : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: N/A*/
#define SENS_SAR2_PWDET_EN  (BIT(24))
#define SENS_SAR2_PWDET_EN_M  (BIT(24))
#define SENS_SAR2_PWDET_EN_V  0x1
#define SENS_SAR2_PWDET_EN_S  24
/* SENS_SAR1_STOP : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: stop SAR ADC1 conversion*/
#define SENS_SAR1_STOP  (BIT(23))
#define SENS_SAR1_STOP_M  (BIT(23))
#define SENS_SAR1_STOP_V  0x1
#define SENS_SAR1_STOP_S  23
/* SENS_SAR2_STOP : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: stop SAR ADC2 conversion*/
#define SENS_SAR2_STOP  (BIT(22))
#define SENS_SAR2_STOP_M  (BIT(22))
#define SENS_SAR2_STOP_V  0x1
#define SENS_SAR2_STOP_S  22
/* SENS_PC_INIT : R/W ;bitpos:[21:11] ;default: 11'b0 ; */
/*description: initialized PC for ULP-coprocessor*/
#define SENS_PC_INIT  0x000007FF
#define SENS_PC_INIT_M  ((SENS_PC_INIT_V) << (SENS_PC_INIT_S))
#define SENS_PC_INIT_V  0x7FF
#define SENS_PC_INIT_S  11
/* SENS_SARCLK_EN : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SENS_SARCLK_EN  (BIT(10))
#define SENS_SARCLK_EN_M  (BIT(10))
#define SENS_SARCLK_EN_V  0x1
#define SENS_SARCLK_EN_S  10
/* SENS_ULP_CP_START_TOP : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: Write 1 to start ULP-coprocessor  only active when reg_ulp_cp_force_start_top
 = 1*/
#define SENS_ULP_CP_START_TOP  (BIT(9))
#define SENS_ULP_CP_START_TOP_M  (BIT(9))
#define SENS_ULP_CP_START_TOP_V  0x1
#define SENS_ULP_CP_START_TOP_S  9
/* SENS_ULP_CP_FORCE_START_TOP : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: 1: ULP-coprocessor is started by SW  0: ULP-coprocessor is started by timer*/
#define SENS_ULP_CP_FORCE_START_TOP  (BIT(8))
#define SENS_ULP_CP_FORCE_START_TOP_M  (BIT(8))
#define SENS_ULP_CP_FORCE_START_TOP_V  0x1
#define SENS_ULP_CP_FORCE_START_TOP_S  8
/* SENS_SAR2_PWDET_CCT : R/W ;bitpos:[7:5] ;default: 3'b0 ; */
/*description: SAR2_PWDET_CCT  PA power detector capacitance tuning.*/
#define SENS_SAR2_PWDET_CCT  0x00000007
#define SENS_SAR2_PWDET_CCT_M  ((SENS_SAR2_PWDET_CCT_V) << (SENS_SAR2_PWDET_CCT_S))
#define SENS_SAR2_PWDET_CCT_V  0x7
#define SENS_SAR2_PWDET_CCT_S  5
/* SENS_SAR2_EN_TEST : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: SAR2_EN_TEST  only active when reg_sar2_dig_force = 0*/
#define SENS_SAR2_EN_TEST  (BIT(4))
#define SENS_SAR2_EN_TEST_M  (BIT(4))
#define SENS_SAR2_EN_TEST_V  0x1
#define SENS_SAR2_EN_TEST_S  4
/* SENS_SAR2_BIT_WIDTH : R/W ;bitpos:[3:2] ;default: 2'b11 ; */
/*description: 00: 9 bit  01: 10 bits  10: 11bits  11: 12bits*/
#define SENS_SAR2_BIT_WIDTH  0x00000003
#define SENS_SAR2_BIT_WIDTH_M  ((SENS_SAR2_BIT_WIDTH_V) << (SENS_SAR2_BIT_WIDTH_S))
#define SENS_SAR2_BIT_WIDTH_V  0x3
#define SENS_SAR2_BIT_WIDTH_S  2
/* SENS_SAR1_BIT_WIDTH : R/W ;bitpos:[1:0] ;default: 2'b11 ; */
/*description: 00: 9 bit  01: 10 bits  10: 11bits  11: 12bits*/
#define SENS_SAR1_BIT_WIDTH  0x00000003
#define SENS_SAR1_BIT_WIDTH_M  ((SENS_SAR1_BIT_WIDTH_V) << (SENS_SAR1_BIT_WIDTH_S))
#define SENS_SAR1_BIT_WIDTH_V  0x3
#define SENS_SAR1_BIT_WIDTH_S  0

#define SENS_SAR_MEM_WR_CTRL_REG          (DR_REG_SENS_BASE + 0x0030)
/* SENS_RTC_MEM_WR_OFFST_CLR : WO ;bitpos:[22] ;default: 1'd0 ; */
/*description: */
#define SENS_RTC_MEM_WR_OFFST_CLR  (BIT(22))
#define SENS_RTC_MEM_WR_OFFST_CLR_M  (BIT(22))
#define SENS_RTC_MEM_WR_OFFST_CLR_V  0x1
#define SENS_RTC_MEM_WR_OFFST_CLR_S  22
/* SENS_MEM_WR_ADDR_SIZE : R/W ;bitpos:[21:11] ;default: 11'd512 ; */
/*description: */
#define SENS_MEM_WR_ADDR_SIZE  0x000007FF
#define SENS_MEM_WR_ADDR_SIZE_M  ((SENS_MEM_WR_ADDR_SIZE_V) << (SENS_MEM_WR_ADDR_SIZE_S))
#define SENS_MEM_WR_ADDR_SIZE_V  0x7FF
#define SENS_MEM_WR_ADDR_SIZE_S  11
/* SENS_MEM_WR_ADDR_INIT : R/W ;bitpos:[10:0] ;default: 11'd512 ; */
/*description: */
#define SENS_MEM_WR_ADDR_INIT  0x000007FF
#define SENS_MEM_WR_ADDR_INIT_M  ((SENS_MEM_WR_ADDR_INIT_V) << (SENS_MEM_WR_ADDR_INIT_S))
#define SENS_MEM_WR_ADDR_INIT_V  0x7FF
#define SENS_MEM_WR_ADDR_INIT_S  0

#define SENS_SAR_ATTEN1_REG          (DR_REG_SENS_BASE + 0x0034)
/* SENS_SAR1_ATTEN : R/W ;bitpos:[31:0] ;default: 32'hffffffff ; */
/*description: 2-bit attenuation for each pad  11:1dB  10:6dB  01:3dB  00:0dB*/
#define SENS_SAR1_ATTEN  0xFFFFFFFF
#define SENS_SAR1_ATTEN_M  ((SENS_SAR1_ATTEN_V) << (SENS_SAR1_ATTEN_S))
#define SENS_SAR1_ATTEN_V  0xFFFFFFFF
#define SENS_SAR1_ATTEN_S  0
#define SENS_SAR1_ATTEN_VAL_MASK   0x3
#define SENS_SAR2_ATTEN_VAL_MASK   0x3

#define SENS_SAR_ATTEN2_REG          (DR_REG_SENS_BASE + 0x0038)
/* SENS_SAR2_ATTEN : R/W ;bitpos:[31:0] ;default: 32'hffffffff ; */
/*description: 2-bit attenuation for each pad  11:1dB  10:6dB  01:3dB  00:0dB*/
#define SENS_SAR2_ATTEN  0xFFFFFFFF
#define SENS_SAR2_ATTEN_M  ((SENS_SAR2_ATTEN_V) << (SENS_SAR2_ATTEN_S))
#define SENS_SAR2_ATTEN_V  0xFFFFFFFF
#define SENS_SAR2_ATTEN_S  0

#define SENS_SAR_SLAVE_ADDR1_REG          (DR_REG_SENS_BASE + 0x003c)
/* SENS_MEAS_STATUS : RO ;bitpos:[29:22] ;default: 8'h0 ; */
/*description: */
#define SENS_MEAS_STATUS  0x000000FF
#define SENS_MEAS_STATUS_M  ((SENS_MEAS_STATUS_V) << (SENS_MEAS_STATUS_S))
#define SENS_MEAS_STATUS_V  0xFF
#define SENS_MEAS_STATUS_S  22
/* SENS_I2C_SLAVE_ADDR0 : R/W ;bitpos:[21:11] ;default: 11'h0 ; */
/*description: */
#define SENS_I2C_SLAVE_ADDR0  0x000007FF
#define SENS_I2C_SLAVE_ADDR0_M  ((SENS_I2C_SLAVE_ADDR0_V) << (SENS_I2C_SLAVE_ADDR0_S))
#define SENS_I2C_SLAVE_ADDR0_V  0x7FF
#define SENS_I2C_SLAVE_ADDR0_S  11
/* SENS_I2C_SLAVE_ADDR1 : R/W ;bitpos:[10:0] ;default: 11'h0 ; */
/*description: */
#define SENS_I2C_SLAVE_ADDR1  0x000007FF
#define SENS_I2C_SLAVE_ADDR1_M  ((SENS_I2C_SLAVE_ADDR1_V) << (SENS_I2C_SLAVE_ADDR1_S))
#define SENS_I2C_SLAVE_ADDR1_V  0x7FF
#define SENS_I2C_SLAVE_ADDR1_S  0

